DataProcessors/ПеремещениеТовараИзЯчейки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПеремещениеТовараИзЯчейки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯчейкаКуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаКудаГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаОткуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаОткудаГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещениеИзЯчейкиМаркировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ПеремещениеТовараИзЯчейки/Forms/ФормаВыбораНоменклатуры/Ext/Form/Module.bsl
&НаКлиенте
Перем Компонента;
&НаКлиенте
Перем РежимВводаАвтоматический;
&НаКлиенте
Перем Ошибка;


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначения.УстановитьРежимВводаНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
		Элементы.ГруппаПоиска.Видимость = Ложь;
		Элементы.ГруппаОписаниеОшибки.Видимость = Истина;
	Иначе 
		Элементы.ГруппаОписаниеОшибки.Видимость = Ложь;
		Элементы.ГруппаПоиска.Видимость = Истина;
	КонецЕсли; 

КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ПараметрыРаботы = ОбщегоНазначения.ПолучитьПараметрыРаботыПриПеремещении();	
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыРаботы);
		
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();	
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда		
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);                                                   
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
	КонецЕсли;

	РежимВводаАвтоматический = ОбщегоНазначения.УстановленРежимВводаАвтоматический();
	Оповестить("ОбновитьОписаниеПодвала");
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Не ВводДоступен() Тогда
		Возврат;
	КонецЕсли; 
	
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода" + СокрЛП(Данные), 4 );
			Возврат;
		КонецЕсли; 
		
		ЭтаФорма.Штрихкод = Результат.Штрихкод;		
		Проверка = ОбщегоНазначенияКлиент.СканированныйШтрихкодЯвляетсяЯчейкой(ЭтаФорма.Штрихкод, Объект.ЯчейкаКуда);
		Если Проверка Тогда
			
			ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();			
			СоздатьДокументПеремещенияПослеСканирЯчейкиКуда(Объект);
			
		Иначе 
			
			ОчиститьЭлементыФормы();		
			УстановитьВидимостьЭлементов();
			ОбработкаОтсканированногоТовара();
			
		КонецЕсли; 
		
		
	ИначеЕсли Событие = "ClipboardEvent" Тогда
		ЭтаФорма.Штрихкод = Данные;
		УстановитьВидимостьЭлементов();
		ОчиститьЭлементыФормы();				
		ОбработкаОтсканированногоТовара();
	КонецЕсли;
		                                                       
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументПеремещенияПослеСканирЯчейкиКуда(Объект)
	
	ПараметрыРаботы	= ОбщегоНазначенияКлиент.СформироватьПараметрыДляФормы("ПеремещениеТовараИзЯчейки", Объект);
	ОбщегоНазначения.ЗаписатьПараметрыРаботы( "ПараметрыРаботыПриПеремещении", ПараметрыРаботы );			
		
	ТекстСообщения = "Создан документ перемещения по ячейкам № %1 %2. Документ проведен";
		
	Результат = ОбщегоНазначения.СоздатьДокументПеремещенияМеждуЯчейкам(Объект.ЯчейкаОткудаГУИД, Объект.ЯчейкаКудаГУИД);
	Если ЗначениеЗаполнено(Результат.Ошибка) Тогда                                                      
		ПоказатьПредупреждение(,"Ошибка: " + Результат.Ошибка, 4);			
		Закрыть();
		Возврат;
	КонецЕсли; 
				
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
					Результат.Данные.НомерДокумента,
					Результат.Данные.ДатаДокумента);						
		
	Оповещение = Новый ОписаниеОповещения("ЗакрытьФормуПослеСообщения", ЭтотОбъект, Параметры);
	ПоказатьПредупреждение(Оповещение, ТекстСообщения, 5);

	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоТовара() Экспорт
		
	Если РежимВводаАвтоматический Тогда
		Результат = ОбработкаШтрихкодаАвтоматический.ОбработкаШтрихкодаВАвтоматическомРежиме(ЭтаФорма, "ПеремещениеТовараИзЯчейки");
	Иначе 
		Результат = ОбработкаШтрихкодаРучной.ОбработкаШтрихкодаВРучномРежиме(ЭтаФорма,"ПеремещениеТовараИзЯчейки");
	КонецЕсли; 	
	
	Если Результат = "КоличествоТоваровБольшеОдного" Тогда
		              		
		Ошибка = "Количество найденных записей по данному штрихкоду " + Штрихкод +  " больше одной !!!" + Символы.ПС;	
		Ошибка = Ошибка + "Выберите товар, через пункт меню ""Товары в ячейке""";
		ОбщегоНазначенияКлиент.ОтобразитьИнформациюОТоваре( "", Ошибка, ЭтаФорма);                                         
		
	ИначеЕсли Результат = "НеизвестныйШтрихкод" Тогда
		
		Структура = Новый Структура;
		Структура.Вставить("Штрихкод", Штрихкод);                            
		Структура.Вставить("ЭтаФорма", ЭтаФорма);					
		// В методе ДиалогНеизвестныйШтрихкод используются "Показать предупреждения"
		ПрисвоитьШтрихкод.ДиалогНеизвестныйШтрихкод(Структура);				
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте                                                                           
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
			Компонента.Отключить();
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимВвода(Команда)
	
	ОбщегоНазначения.УстановитьРежимВводаНаСервере();
	РежимВводаАвтоматический = ОбщегоНазначения.УстановленРежимВводаАвтоматический();
			
	Оповестить("ОбновитьОписаниеПодвала");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
	Если ИмяСобытия = "СканированиеШтрихкода" Тогда
		
		#Если МобильноеПриложениеКлиент Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеОшибки) Тогда
			Компонента.Отключить();
		Иначе
			Компонента.Подключить();
		КонецЕсли; 
		#КонецЕсли 	
		
		УстановитьВидимостьЭлементов();		
		
	КонецЕсли; 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	Если ИмяСобытия = "ОбновитьОписаниеПодвала" Тогда
		ЭтаФорма.ОписаниеРежимВводаКоличества = ОбщегоНазначенияКлиент.ПолучитьОтображениеОРежимеВводеКоличества();
		ЭтаФорма.ОписаниеСотрудника = ОбщегоНазначенияКлиент.ПолучитьОписаниеСотрудника();
	КонецЕсли; 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		
	Если ИмяСобытия = "ОбработатьДобавленныйШтрихкод" Тогда	
		
		Если РежимВводаАвтоматический Тогда
			Результат = ОбработкаШтрихкодаАвтоматический.ОбработкаШтрихкодаВАвтоматическомРежиме(ЭтаФорма, "ПеремещениеТовараИзЯчейки");
		Иначе 
			Результат = ОбработкаШтрихкодаРучной.ОбработкаШтрихкодаВРучномРежиме(ЭтаФорма, "ПеремещениеТовараИзЯчейки");
		КонецЕсли; 	
		
	КонецЕсли; 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	

КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Поиск) Тогда
		ПоказатьПредупреждение(, "Введите код или штрихкод.", 4);
		Возврат;
	КонецЕсли; 
		
	ЭтаФорма.Штрихкод = ЭтаФорма.Поиск;
	
	Проверка = ОбщегоНазначенияКлиент.СканированныйШтрихкодЯвляетсяЯчейкой(ЭтаФорма.Штрихкод, Объект.ЯчейкаКуда);
	Если Проверка Тогда
		
		ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();         
		СоздатьДокументПеремещенияПослеСканирЯчейкиКуда(Объект);
		
	Иначе
		
		ОчиститьЭлементыФормы();
		ОбработкаОтсканированногоТовара();			
				
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСканирование(Команда)
	
	ЭтаФорма.ОписаниеОшибки = "";
	ЭтаФорма.ОписаниеНайденногоТовара =  "";
	ЭтаФорма.Штрихкод = "";
	ЭтаФорма.Поиск = "";
	
	Оповестить("СканированиеШтрихкода");	
	
КонецПроцедуры

// Вызов формы товары документа
&НаКлиенте                                        
Процедура ТоварыВЯчейке(Команда)
	
	ЭтаФорма.Поиск = "";
	ЭтаФорма.Штрихкод = "";
	ЭтаФорма.ОписаниеНайденногоТовара =  "";	
	ЭтаФорма.ОписаниеОшибки = "";
		
	Оповестить("СканированиеШтрихкода");	
		
	РезультатСтруктура = ОбщегоНазначения.ПолучитьСписокТоваровИзЯчейки(Объект.ЯчейкаОткудаГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 
			
	Оповещение = Новый ОписаниеОповещения("ПолучениеДанныхПриЗакрытииФормыТоварыДокумента", ЭтаФорма);
		
	ИмяФормыВычисл = ПолучитьПолноеИмяФормы("ФормаТоварыВячейке");
	ОткрытьФорму(ИмяФормыВычисл, , ЭтаФорма,,, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеДанныхПриЗакрытииФормыТоварыДокумента(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат <> Неопределено Тогда
		
		ЭтаФорма.Штрихкод = "";
		ЭтаФорма.ТоварГУИД = Результат.ТоварГУИД;
		ОбработкаОтсканированногоТовара();	
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Функция ОчиститьЭлементыФормы()
	
	ЭтаФорма.ТоварГУИД = "";
	ЭтаФорма.ОписаниеНайденногоТовара = "";
	ЭтаФорма.Поиск = "";
	ЭтаФорма.ОписаниеОшибки = "";	
	
КонецФункции
 
Функция ПолучитьПолноеИмяФормы(ИмяФормы) 

Возврат Лев(ЭтаФорма.ИмяФормы, Найти(ЭтаФорма.ИмяФормы,".Форма.")+6) + ИмяФормы; 

КонецФункции

&НаКлиенте
Процедура Внести(Команда)
	
	ОбработкаШтрихкодаРучной.ОбработатьВведеноеКоличествоТовара(ЭтаФорма,  "ПеремещениеТовараИзЯчейки");
	
КонецПроцедуры


&НаКлиенте
Процедура Завершить(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("СоздатьДокументРазмещения", ЭтотОбъект, Параметры);
	ТекстВопроса = "Создать документ размещения " + Символы.ПС;
	ТекстВопроса = ТекстВопроса + " товаров по местам хранения ?";
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим); 
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументРазмещения(Результат, Параметры) Экспорт
		
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;	
	
	РезультатСтруктура = ОбщегоНазначения.СоздатьДокуметРазмещенияПоЯчейкам(Объект.ДокументГУИД);
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		Если НЕ РезультатСтруктура.Ошибка = "Отсутствуют отсканированные строки документа" Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли; 
	
	ТекстСообщения = "Создан документ размещения по ячейкам № %1 %2. Документ проведен";
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
			РезультатСтруктура.Данные.НомерДокумента,
			РезультатСтруктура.Данные.ДатаДокумента 
			);						
			
	Оповещение = Новый ОписаниеОповещения("ЗакрытьФормуПослеСообщения", ЭтотОбъект, Параметры);
	ПоказатьПредупреждение(Оповещение, ТекстСообщения, 4);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуПослеСообщения(Результат) Экспорт 
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПланФакт(Команда)
	РезультатСтруктура = ОбщегоНазначения.ПолучитьОстатокПоВсемТоварамИзДокумента(Объект.ДокументГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
	КонецЕсли; 
			                                  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументГУИД", Объект.ДокументГУИД);
	ИмяФормыВычисл = ПолучитьПолноеИмяФормы("ФормаТоварыПланФакт");
	ОткрытьФорму(ИмяФормыВычисл, ПараметрыФормы, ЭтаФорма,,, , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
